---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.BadDimensions
enum: Autodesk.Revit.DB.Fabrication.FabricationPartFitResult
source: html/36a9c1b4-343e-c0ce-fd27-8b42b8a82288.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.BadDimensions

Failed due to the required dimension values not being valid to fabricate.